<!-- add-pr-comment:add-pr-comment -->

## Terraform CloudWatch Alarms plan
```
module.unauthorised_users_modify_repository_settings_mod_platform_alarm.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.levgorbunov1_cancel_workflow_alarm.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorised_users_modify_repository_settings_alarm.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.operations_engineering_topic.aws_sns_topic.sns_topic: Refreshing state... [id=arn:aws:sns:eu-west-2:880656497252:operations-engineering-github-alerts]
module.levgorbunov1_cancel_workflow_alarm.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.levgorbunov1_cancel_workflow_alarm.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=Levgorbunov1CancelWorkflowEvents]
module.unauthorised_users_modify_repository_settings_mod_platform_alarm.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorised_users_modify_repository_settings_alarm.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorised_users_modify_repository_settings_alarm.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=UnathorisedUsersModifyRepositorySettingsEvents]
module.operations_engineering_topic.aws_sns_topic_subscription.email_subscription["lev.gorbunov@digital.justice.gov.uk"]: Refreshing state... [id=arn:aws:sns:eu-west-2:880656497252:operations-engineering-github-alerts:27741290-2203-45ed-8cd0-9982d078f215]
module.unauthorised_users_modify_repository_settings_alarm.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=UnathorisedUsersModifyRepositorySettingsEventsAlarm]
module.levgorbunov1_cancel_workflow_alarm.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=Levgorbunov1CancelWorkflowEventsAlarm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.modernisation_platform_topic.aws_sns_topic.sns_topic will be created
  + resource "aws_sns_topic" "sns_topic" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "modernisation-platform-github-alerts"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.modernisation_platform_topic.aws_sns_topic_subscription.email_subscription["kudzai.mtoko@digital.justice.gov.uk"] will be created
  + resource "aws_sns_topic_subscription" "email_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "kudzai.mtoko@digital.justice.gov.uk"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.modernisation_platform_topic.aws_sns_topic_subscription.email_subscription["modernisation-platform@digital.justice.gov.uk"] will be created
  + resource "aws_sns_topic_subscription" "email_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "modernisation-platform@digital.justice.gov.uk"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.unauthorised_users_modify_repository_settings_alarm.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
        id             = "UnathorisedUsersModifyRepositorySettingsEvents"
        name           = "UnathorisedUsersModifyRepositorySettingsEvents"
      ~ pattern        = "{ ($.eventName = \"repo.access\" || $.eventName = \"repo.add_member\" || $.eventName = \"repo.change_merge_setting\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform\") }" -> "{ ($.userIdentity.principalId != \"testuser1\") && ($.eventName = \"repo.access\" || $.eventName = \"repo.add_member\" || $.eventName = \"repo.change_merge_setting\") && ($.userIdentity.details.Repository = \"ministryofjustice/operations-engineering-github-cloudwatch-alarms\") }"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.unauthorised_users_modify_repository_settings_alarm.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
          + "arn:aws:sns:eu-west-2:880656497252:operations-engineering-github-alerts",
        ]
      ~ alarm_description         = "Alarm for when any user modifies the settings of ministryofjustice/modernisation-platform repository" -> "Alarm for when any user other than testuser1 modifies the settings of ministryofjustice/operations-engineering-github-cloudwatch-alarms repository"
        id                        = "UnathorisedUsersModifyRepositorySettingsEventsAlarm"
        tags                      = {}
        # (16 unchanged attributes hidden)
    }

  # module.unauthorised_users_modify_repository_settings_mod_platform_alarm.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "UnathorisedUsersModifyRepositorySettingsEvents"
      + pattern        = "{ ($.eventName = \"repo.access\" || $.eventName = \"repo.add_member\" || $.eventName = \"repo.change_merge_setting\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform\" || $.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-terraform-ec2-instance\") }"

      + metric_transformation {
          + name      = "UnathorisedUsersModifyRepositorySettingsEvents"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorised_users_modify_repository_settings_mod_platform_alarm.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm for when any user modifies the settings of ministryofjustice/modernisation-platform repository"
      + alarm_name                            = "UnathorisedUsersModifyRepositorySettingsEventsAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "UnathorisedUsersModifyRepositorySettingsEvents"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

Plan: 5 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```